import random

# Части имени
nicknames = [
    "Черный", "Красный", "Золотой", "Серебряный", "Бешеный",
    "Кровавый", "Железный", "Штормовой", "Теневой", "Дикий",
    "Грозный", "Безумный", "Хитрый", "Соленый", "Скалистый",
    "Буряной", "Огненный", "Ночной", "Грозовой", "Ледяной",
    "Яростный", "Ветряной", "Призрачный", "Лунный", "Адский",
    "Королевский", "Бесстрашный", "Светлый", "Бронзовый", "Чумной",
    "Мрачный", "Пылающий", "Песчаный", "Костяной", "Болотный",
    "Тёмный", "Буревестный", "Облачный", "Охотничий", "Снежный",
    "Молниеносный", "Солнечный", "Голодный", "Тихий", "Беспощадный",
    "Лютый", "Стальной", "Бледный", "Коварный", "Бессмертный",
    "Грозящий", "Крылатый", "Вечный", "Мертвенный", "Бушующий",
    "Духовный", "Вихревой", "Трёхглавый", "Звёздный", "Огромный",
    "Чёрствый", "Разрушительный", "Титанический", "Древний", "Водяной",
    "Горящий", "Каменный", "Роковой", "Пыльный", "Светящийся",
    "Пепельный", "Гибельный", "Морозный", "Тропический", "Лесной",
    "Холодный", "Благородный", "Медный", "Ослепительный", "Алмазный",
    "Сквозной", "Грозовой", "Чёрный", "Кристальный", "Туманный",
    "Пьянящий", "Жаркий", "Жестокий", "Зловещий", "Бурлящий"
]

# Основы
bases = [
    "Джек", "Энн", "Морган", "Крюк", "Флинт", "Ворон",
    "Клык", "Костяной", "Борода", "Рейвен", "Волк", "Карабин",
    "Шпагат", "Охотник", "Морской", "Разбойник", "Капитан",
    "Ястреб", "Змея", "Тигр", "Орел", "Таран", "Ланс",
    "Варвар", "Барон", "Дракон", "Лансер", "Кочевник",
    "Акула", "Тарантул", "Сокол", "Вождь", "Медведь",
    "Грифон", "Пират", "Гладиатор", "Всадник", "Призрак",
    "Штурман", "Гарпун", "Зверь", "Тень", "Китобой",
    "Стрелок", "Бандит", "Тюлень", "Шаман", "Сапсан",
    "Корсар", "Сокол", "Саламандра", "Чудовище", "Легионер",
    "Лев", "Палач", "Тритон", "Минотавр", "Громовержец",
    "Олень", "Странник", "Сирена", "Охотник", "Арбалетчик",
    "Бык", "Чёрт", "Зодчий", "Хищник", "Дельфин",
    "Зверолов", "Зверобой", "Мастер", "Ткач", "Гончар",
    "Сокол", "Морж", "Альбатрос", "Орлан", "Дервиш",
    "Ветер", "Летучий", "Хранитель", "Молот", "Гигант",
    "Бык", "Шип", "Змей", "Рысь", "Пастырь",
    "Моряк", "Старейшина", "Пантера", "Шторм", "Воевода"
]


def get_random_name():
    nickname = random.choice(nicknames)
    base = random.choice(bases)
    return f"{nickname} {base}"
